app/Controllers/Usuario.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL
 LIMIT 10, 5
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL
---
    public function index(){
        return view('usuarios', [
            'usuarios' => $this->UsuarioModel->paginate(5), // Tras vizualizaçao dos dados por paginas, 5 em 5 registros.
            'paginas' => $this->UsuarioModel->pager
        ]);

UPDATE `usuarios` SET `deleted_at` = '2022-03-06 01:33:11', `updated_at` = '2022-03-06 01:33:11'
WHERE `id` IN ('8')
---
    public function delete($id){
        if ($this->UsuarioModel->delete($id)){

INSERT INTO `usuarios` (`nome`, `sobrenome`, `login`, `email`, `created_at`, `updated_at`) VALUES ('Emerson', 'Barbosa Gomes', 'multi.locteste', 'emersonbarbosa9002@gmail.com', '2022-04-09 16:59:48', '2022-04-09 16:59:48')
UPDATE `usuarios` SET `nome` = 'Ramon', `sobrenome` = 'Rodrigues', `login` = 'r_rodrigues', `email` = 'ramonrodriguesnw@gmail.com', `updated_at` = '2022-03-06 01:33:01'
WHERE `usuarios`.`id` IN ('3')
---
    public function store(){
        if ($this->UsuarioModel->save($this->request->getPost())) {

SELECT *
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL
AND `usuarios`.`id` = '141'
---
    public function editar($id){
        return view('form',[
            'useredit' => $this->UsuarioModel->find($id)
        ]);