app/Controllers/Usuario.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL
 LIMIT 7
---
    public function index(){
        return view('usuarios', [
            'usuarios' => $this->UsuarioModel->paginate(6), // Tras vizualizaçao dos dados por paginas, 5 em 5 registros.
            'paginas' => $this->UsuarioModel->pager
        ]);